[
    [
        [
            "Hola como estas?",
            "¡Hola! Estoy aquí y listo para ayudarte. ¿Cómo estás tú?"
        ]
    ],
    [
        [
            "Como estas miamor?",
            "¡Hola! Estoy aquí y listo para ayudarte. ¿Y tú, cómo estás?"
        ],
        [
            "Dame los tres animales mas rapidos del mundo",
            "Claro, aquí tienes los tres animales más rápidos del mundo:\n\n1. **Peregrino** (Falco peregrinus): Este halcón es el ave más rápida del mundo, capaz de alcanzar velocidades de hasta 240 km/h (149 mph) durante sus picados.\n  \n2. **Guepardo** (Acinonyx jubatus): Es el mamífero terrestre más rápido, capaz de correr a velocidades de hasta 112 km/h (70 mph) en cortas distancias.\n\n3. **Marlin negro** (Istiompax indica): Este pez es uno de los más rápidos en el agua, alcanzando velocidades de 82 km/h (51 mph).\n\n¿Te gustaría saber más sobre alguno de estos animales?"
        ]
    ],
    [
        [
            "Hola cuando se fundó el FC Barcelona?",
            "El FC Barcelona fue fundado el 29 de noviembre de 1899. Es uno de los clubes de fútbol más importantes y reconocidos del mundo. ¿Te gustaría saber algo más sobre su historia o algún otro aspecto del club?"
        ],
        [
            "Quien es el mejor jugador de su historia?",
            "Elegir al mejor jugador en la historia del FC Barcelona es subjetivo y puede variar según las opiniones de los aficionados. Sin embargo, dos nombres que siempre se destacan son Lionel Messi y Johan Cruyff.\n\n- **Lionel Messi**: Considerado uno de los mejores futbolistas de todos los tiempos, Messi jugó en el Barcelona desde 2004 hasta 2021. Durante su tiempo en el club, ganó numerosos títulos y rompió numerosos récords, convirtiéndose en el máximo goleador de la historia del club.\n\n- **Johan Cruyff**: Además de ser una leyenda como jugador, Cruyff tuvo un gran impacto como entrenador en el Barcelona, donde implantó un estilo de juego que ha perdurado a lo largo de los años. Su legado en el club es enorme.\n\nAmbos son figuras icónicas en la historia del Barça. ¿Tienes algún otro jugador en mente o algún aspecto específico que quieras discutir?"
        ]
    ]
]